clear;clc;
d1=0.00022;         %外侧斜拉索直径
d2=0.00016;         %内侧斜拉索直径
rou=8015.111293;    %斜拉索材料密度
E=1.9e11;           %斜拉索材料弹性模量
cableNode=[1,40;4,38;10,38;13,40;17,53;20,51;26,51;29,53];
cableAngle=[33.6901;45;139.3987;150.2551;29.7449;40.6013;135;146.3099];
cableL=[1.44222;0.84853;0.92195;1.61245;1.61245;0.92195;0.84853;1.44222];
cableEA=[E*d1^2*pi/4;E*d2^2*pi/4;E*d2^2*pi/4;E*d1^2*pi/4*1;
    E*d1^2*pi/4;E*d2^2*pi/4;E*d2^2*pi/4;E*d1^2*pi/4];
cableM=[rou*d1^2*pi/4;rou*d2^2*pi/4;rou*d2^2*pi/4;rou*d1^2*pi/4;
    rou*d1^2*pi/4;rou*d2^2*pi/4;rou*d2^2*pi/4;rou*d1^2*pi/4;];
save Mcable_element_inf c*
%生成索单元