function y=MCableMassAssemble(M,m,i,j)
%m表示索单元单元质量矩阵，为4*4矩阵；
%K表示将要代入的总体质量矩阵；
%i表示索单元左节点自由度号(总体刚度矩阵中号）；
%j表示索单元右节点自由度号(总体刚度矩阵中号）；
M(3*i-2,3*i-2)=M(3*i-2,3*i-2)+m(1,1);
M(3*i-2,3*i-1)=M(3*i-2,3*i-1)+m(1,2);
M(3*i-2,3*j-1)=M(3*i-2,3*j-1)+m(1,3);
M(3*i-2,3*j-2)=M(3*i-2,3*j-2)+m(1,4);

M(3*i-1,3*i-2)=M(3*i-1,3*i-2)+m(2,1);
M(3*i-1,3*i-1)=M(3*i-1,3*i-1)+m(2,2);
M(3*i-1,3*j-1)=M(3*i-1,3*j-1)+m(2,3);
M(3*i-1,3*j-2)=M(3*i-1,3*j-2)+m(2,4);

M(3*j-1,3*i-2)=M(3*j-1,3*i-2)+m(3,1);
M(3*j-1,3*i-1)=M(3*j-1,3*i-1)+m(3,2);
M(3*j-1,3*j-1)=M(3*j-1,3*j-1)+m(3,3);
M(3*j-1,3*j-2)=M(3*j-1,3*j-2)+m(3,4);

M(3*j-2,3*i-2)=M(3*j-2,3*i-2)+m(4,1);
M(3*j-2,3*i-1)=M(3*j-2,3*i-1)+m(4,2);
M(3*j-2,3*j-1)=M(3*j-2,3*j-1)+m(4,3);
M(3*j-2,3*j-2)=M(3*j-2,3*j-2)+m(4,4);

y=M;
end

